// 문제 : 엄청난 부자2

const input = '1000 100'.split(' ');

const solution = (money, creatures) => {
	console.log(String(BigInt(money) / BigInt(creatures)));
	console.log(String(BigInt(money) % BigInt(creatures)));
};

// bigInt 타입을 파라미터로 넘길때도 아규먼트를 bigInt 타입이나 string 타입으로 보내야함.
// solution(10000000000000000000000000000000000000000000000000000000000000000000000000000000000000, 100) 처럼
// 아규먼트 상에서 2^53 - 1 이상의 수를 number 타입으로 보내버리면 정밀도가 떨어지기 때문에
// solution('10000000000000000000000000000000000000000000000000000000000000000000000000000000000000','100')
// 와 같이 문자열로 바꾸거나 bigInt 객체로 만들어서 함수 내부로 전달해야함
solution(
	'10000000000000000000000000000000000000000000000000000000000000000000000000000000000000',
	'100'
);
